# VertexStreamPosition Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexStreamPosition Class
Members See Also
---
A stream that can be used to write vertices of type VertexPosition into a buffer (see VertexBuffer).
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class VertexStreamPosition : VertexStream
```

Visual Basic
---
```text
Public Class VertexStreamPosition _
	Inherits VertexStream
```

Visual C++
---
```text
public ref class VertexStreamPosition : public VertexStream
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..VertexStream Autodesk.Revit.DB.DirectContext3D..::..VertexStreamPosition
# See Also
VertexStreamPosition Members
Autodesk.Revit.DB.DirectContext3D Namespace